zhuhuijia0001/ch559-usb-host/UsbHost.c
static void FillSetupReq(USB_SETUP_REQ *const pSetupReq, UINT8 type, UINT8 req, UINT16 value, UINT16 index, UINT16 length)
{
	pSetupReq->bRequestType = type;
	pSetupReq->bRequest     = req;
	pSetupReq->wValueL      = value & 0xff;
	pSetupReq->wValueH      = (value >> 8) & 0xff;
	pSetupReq->wIndexL      = index & 0xff;
	pSetupReq->wIndexH      = (index >> 8) & 0xff;
	pSetupReq->wLengthL     = length & 0xff;
	pSetupReq->wLengthH     = (length >> 8) & 0xff;
}

//-----------------------------------------------------------------------------------------
static UINT8 GetDeviceDescr(UINT8 MaxPacketSize0, UINT8 *pDevDescr, UINT16 reqLen, UINT16 *pRetLen)		//get device describtion
{
	UINT8	s;
	UINT16 len;

	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_IN | USB_REQ_TYP_STANDARD | USB_REQ_RECIP_DEVICE, 
				USB_GET_DESCRIPTOR, USB_DESCR_TYP_DEVICE << 8, 0, reqLen);

	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, pDevDescr, &len); 
	
	if (s == ERR_SUCCESS)
	{
		if (pRetLen != NULL)
		{		
			*pRetLen = len;
		}		
	}
	
	return s;
}


//----------------------------------------------------------------------------------------
static UINT8 GetConfigDescr(UINT8 MaxPacketSize0, UINT8 *pCfgDescr, UINT16 reqLen, UINT16 *pRetLen) 
{
	UINT8	s;
	UINT16  len;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_IN | USB_REQ_TYP_STANDARD | USB_REQ_RECIP_DEVICE, 
				USB_GET_DESCRIPTOR, USB_DESCR_TYP_CONFIG << 8, 0, reqLen);
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, pCfgDescr, &len);
	if (s == ERR_SUCCESS) 
	{
		if (pRetLen != NULL)
		{
			*pRetLen = len;
		}
	}

	return s;
}


//-------------------------------------------------------------------------------------
static UINT8 SetUsbAddress(UINT8 MaxPacketSize0, UINT8 addr)
{
	UINT8	s;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_STANDARD | USB_REQ_RECIP_DEVICE, 
				USB_SET_ADDRESS, addr, 0, 0);
	
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, NULL, NULL);			
	if (s == ERR_SUCCESS)
	{
		SetHostUsbAddr(addr);
	}

	return s;
}

//-------------------------------------------------------------------------------------
static UINT8 SetUsbConfig(UINT8 MaxPacketSize0, UINT8 cfg) 
{
	UINT8	s;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_STANDARD | USB_REQ_RECIP_DEVICE, 
				USB_SET_CONFIGURATION, cfg, 0, 0);

	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, NULL, NULL);			

	return s;
}


//-----------------------------------------------------------------------------------------
static UINT8 GetHubDescriptor(UINT8 MaxPacketSize0, UINT8 *pHubDescr, UINT16 reqLen, UINT16 *pRetLen)
{
	UINT8	s;
	UINT16  len;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_IN | USB_REQ_TYP_CLASS | USB_REQ_RECIP_DEVICE, 
				USB_GET_DESCRIPTOR, USB_DESCR_TYP_HUB << 8, 0, reqLen);
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, (UINT8 *)pHubDescr, &len);
	
	if (s == ERR_SUCCESS) 
	{	
		if (pRetLen != NULL)
		{
			*pRetLen = len;
		}
	}
	
	return s;	
}


//-----------------------------------------------------------------------------------------
static UINT8 GetHubPortStatus(UINT8 MaxPacketSize0, UINT8 HubPort, UINT16 *pPortStatus, UINT16 *pPortChange)
{
	UINT8	s;
	UINT16  len;
	
	UINT8   Ret[4];
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_IN | USB_REQ_TYP_CLASS | USB_REQ_RECIP_OTHER, 
				USB_GET_STATUS, 0, HubPort, 4);
				
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, Ret, &len);
	if(s == ERR_SUCCESS)
	{
		if (pPortStatus != NULL)
		{
			*pPortStatus = (Ret[1] << 8) | Ret[0];
		}
		
		if (pPortChange != NULL)
		{
			*pPortChange = (Ret[3] << 8) | Ret[2];
		}
	}
	
	return s;
}


//------------------------------------------------------------------------------------------
static UINT8 SetHubPortFeature(UINT8 MaxPacketSize0, UINT8 HubPort, UINT8 selector)		//this function set feature for port						//this funciton set
{
	UINT8	s;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_CLASS | USB_REQ_RECIP_OTHER, 
				USB_SET_FEATURE, selector, (0 << 8) | HubPort, 0);
			
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, NULL, NULL);

	return s;
}

static UINT8 ClearHubPortFeature(UINT8 MaxPacketSize0, UINT8 HubPort, UINT8 selector)
{
	UINT8	s;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_CLASS | USB_REQ_RECIP_OTHER, 
				USB_CLEAR_FEATURE, selector, (0 << 8) | HubPort, 0);
		
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, NULL, NULL);

	return s;
}


//-----------------------------------------------------------------------------------------
static UINT8 GetReportDescriptor(UINT8 MaxPacketSize0, UINT8 interface, UINT8 *pReportDescr, UINT16 reqLen, UINT16 *pRetLen)
{
	UINT8	s;
	UINT16  len;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_IN | USB_REQ_TYP_STANDARD| USB_REQ_RECIP_INTERF, 
				USB_GET_DESCRIPTOR, USB_DESCR_TYP_REPORT << 8, interface, reqLen);
	
	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, pReportDescr, &len);
	
	if (s == ERR_SUCCESS) 
	{	
		if (pRetLen != NULL)
		{
			*pRetLen = len;
		}
	}
	
	return s;
}


//-----------------------------------------------------------------------------------------
static UINT8 SetIdle(UINT8 MaxPacketSize0, UINT16 durationMs, UINT8 reportID, UINT8 interface) 
{
	UINT8 s;
	
	USB_SETUP_REQ   SetupReq;
	UINT8 duration = (UINT8)(durationMs / 4);
	
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_CLASS | USB_REQ_RECIP_INTERF, 
				HID_SET_IDLE, (duration << 8) | reportID, interface, 0);

	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0,  NULL, NULL);
	
	return s;
}

//-----------------------------------------------------------------------------------------------
static UINT8 SetReport(UINT8 MaxPacketSize0, UINT8 interface, UINT8 *pReport, UINT16 ReportLen)
{
	UINT8	s;
	UINT16  len;
	
	USB_SETUP_REQ SetupReq;
	FillSetupReq(&SetupReq, USB_REQ_TYP_OUT | USB_REQ_TYP_CLASS | USB_REQ_RECIP_INTERF, 
				HID_SET_REPORT, HID_REPORT_OUTPUT << 8, interface, ReportLen);

	s = HostCtrlTransfer(&SetupReq, MaxPacketSize0, pReport, &len);			

	return s;
}


//-----------------------------------------------------------------------------------------------
void InitUsbData(void)
{
	int i;
	
	for (i = 0; i < ROOT_HUB_PORT_NUM; i++)
	{
		InitRootHubPortData(i);			
	}
}

static UINT8 TransferReceive(UINT8 endpointAddr, BOOL tog, UINT8 *pData, UINT16 *pRetLen)
{
	UINT8 s;
	UINT8 len;

