zhuhuijia0001/ch559-usb-host/UsbHost.c
	s = USBHostTransact(USB_PID_IN << 4 | (endpointAddr & 0x7F), tog ? bUH_R_TOG | bUH_T_TOG : 0, 0 );// CH559传输事务,获取数据,NAK不重试
	if (s == ERR_SUCCESS)
	{
		UINT8 i;
		len = USB_RX_LEN;
					
		for (i = 0; i < len; i++)
		{
			*pData++ = RxBuffer[i];
		}
		
		*pRetLen = len;
	}
	
	return(s);
}


//-------------------------------------------------------------------------------------------
static UINT8 HIDDataTransferReceive(USB_DEVICE *const pUsbDevice)
{
	UINT8 s;
	int i, j;
	int interfaceNum;
	int endpointNum;
	
	UINT16 len;	
	interfaceNum = pUsbDevice->InterfaceNum;
	for (i = 0; i < interfaceNum; i++)
	{
		if (pUsbDevice->Interface[i].InterfaceClass == USB_DEV_CLASS_HID)
		{ 
			endpointNum = pUsbDevice->Interface[i].EndpointNum;
			for (j = 0; j < endpointNum; j++)
			{
				if (pUsbDevice->Interface[i].Endpoint[j].EndpointDir == ENDPOINT_IN)
				{
					s = TransferReceive(pUsbDevice->Interface[i].Endpoint[j].EndpointAddr, 
										pUsbDevice->Interface[i].Endpoint[j].TOG,
													ReceiveDataBuffer, &len);
					if (s == ERR_SUCCESS)
					{
						pUsbDevice->Interface[i].Endpoint[j].TOG = pUsbDevice->Interface[i].Endpoint[j].TOG ? FALSE : TRUE;
						
						ProcessHIDData(&pUsbDevice->Interface[i], ReceiveDataBuffer, len);
					}
				}
			}
		}
	}
	
	return(s);
}

static BOOL ParseDeviceDescriptor(const USB_DEV_DESCR *const pDevDescr, UINT8 len, USB_DEVICE *const pUsbDevice)
{
	if (len > sizeof(USB_DEV_DESCR))
	{
		return FALSE;
	}
	
	pUsbDevice->MaxPacketSize0 = pDevDescr->bMaxPacketSize0;
	pUsbDevice->DeviceClass = pDevDescr->bDeviceClass;

	if (len == sizeof(USB_DEV_DESCR))
	{
		pUsbDevice->VendorID = pDevDescr->idVendorL | (pDevDescr->idVendorH << 8);
		pUsbDevice->ProductID = pDevDescr->idProductL | (pDevDescr->idProductH << 8);
		pUsbDevice->bcdDevice = pDevDescr->bcdDeviceL | (pDevDescr->bcdDeviceH << 8);
	}
	
	return TRUE;
}


static BOOL ParseConfigDescriptor(const USB_CFG_DESCR *const pCfgDescr, UINT16 len, USB_DEVICE *const pUsbDevice)
{
	int index;

	UINT8 *pDescr;
	DESCR_HEADER *pDescrHeader;
	USB_ITF_DESCR *pItfDescr;
	USB_ENDP_DESCR *pEdpDescr;
	UINT8 descrType;
	int endpointIndex;

	UINT16 totalLen = pCfgDescr->wTotalLengthL | (pCfgDescr->wTotalLengthH << 8);
	if (totalLen > len)
	{
		totalLen = len;
	}

	pUsbDevice->InterfaceNum = pCfgDescr->bNumInterfaces;
	if (pUsbDevice->InterfaceNum > MAX_INTERFACE_NUM)
	{
		pUsbDevice->InterfaceNum = MAX_INTERFACE_NUM;
	}

	pDescr = (UINT8 *)pCfgDescr;

	pDescr += pCfgDescr->bLength;

	index = pCfgDescr->bLength;


	while (index < totalLen)
	{
		pDescrHeader = (DESCR_HEADER *)pDescr;
		descrType = pDescrHeader->bDescriptorType;

		if (descrType == USB_DESCR_TYP_INTERF)
		{
			//interface descriptor
			pItfDescr = (USB_ITF_DESCR *)pDescr;
			if (pItfDescr->bInterfaceNumber >= pUsbDevice->InterfaceNum)
			{
				break;
			}
			
			if (pItfDescr->bAlternateSetting == 0)
			{
				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].EndpointNum = 0;

				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].InterfaceClass = pItfDescr->bInterfaceClass;
				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].InterfaceProtocol = pItfDescr->bInterfaceProtocol;
			}
		}
		else if (descrType == USB_DESCR_TYP_ENDP)
		{
			//endpoint descriptor
			pEdpDescr = (USB_ENDP_DESCR *)pDescr;

			if (pUsbDevice->Interface[pItfDescr->bInterfaceNumber].EndpointNum >= MAX_ENDPOINT_NUM)
			{
				goto ONE_FINISH;
			}
			
			if (pItfDescr->bAlternateSetting == 0)
			{
				endpointIndex = pUsbDevice->Interface[pItfDescr->bInterfaceNumber].EndpointNum;
				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].EndpointNum++;
				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].Endpoint[endpointIndex].EndpointAddr = pEdpDescr->bEndpointAddress & 0x7f;
				if (pEdpDescr->bEndpointAddress & 0x80)
				{
					pUsbDevice->Interface[pItfDescr->bInterfaceNumber].Endpoint[endpointIndex].EndpointDir = ENDPOINT_IN;
				}
				else
				{
					pUsbDevice->Interface[pItfDescr->bInterfaceNumber].Endpoint[endpointIndex].EndpointDir = ENDPOINT_OUT;
				}

				pUsbDevice->Interface[pItfDescr->bInterfaceNumber].Endpoint[endpointIndex].MaxPacketSize = pEdpDescr->wMaxPacketSizeL | (pEdpDescr->wMaxPacketSizeH << 8);
			}	
		}
ONE_FINISH:		
		pDescr += pDescrHeader->bDescLength;

		index += pDescrHeader->bDescLength;
	}

	return TRUE;
}

static UINT8 ParseReportDescriptor(const UINT8 *pDescriptor, UINT16 len, HID_SEG_STRUCT *const pHidSegStruct)
{
	UINT8 i, j;
	
	UINT8 dataSize;
	UINT8 dat;
	UINT8 startBit = 0;
	UINT8 curUsagePage = USAGE_PAGE_NONE, curReportSize = 0, curReportCount = 0, curReportID = 0;
	
	USAGE arrUsage[5];
	UINT8 usagePtr = 0;
	
	const UINT8 *p = pDescriptor;
	HID_ITEM_INFO hid_item;
	i = 0;
	
	while (i < len)
	{
		hid_item.ItemDetails.val = *p;
		
		dataSize = hid_item.ItemDetails.ItemVal.ItemSize;
		if (dataSize == 3)
		{
			dataSize = 4;
		}
		
		switch (hid_item.ItemDetails.ItemVal.ItemType)
		{
		case TYPE_MAIN:
			if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_INPUT)
			{
				//是输入数据
				if (curUsagePage == USAGE_PAGE_BUTTON)
				{
					//是按键
					dat = *(p + 1);

					if (!(dat & 0x01))
					{
						//为变量
						pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segStart = startBit;
						pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segSize = curReportSize * curReportCount;
					}
					
					startBit += curReportSize * curReportCount;
				}
				else if (curUsagePage == USAGE_PAGE_KEYBOARD)
				{
                    //是键盘
                    dat = *(p + 1);

                    if (pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segSize == 0)
                    {
                        pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segStart = startBit;
                    }
                    
                    pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segSize += curReportSize * curReportCount;
					
					startBit += curReportSize * curReportCount;
				}
				else
				{
					if (usagePtr > 0)
					{
						//有usage
						j = 0;
						while (j < usagePtr)
						{
							if (arrUsage[j].usageLen == 1)
							{
								if (arrUsage[j].usage[0] == USAGE_X)
								{
									//是x
									pHidSegStruct->HIDSeg[HID_SEG_X_INDEX].segStart = startBit;
									pHidSegStruct->HIDSeg[HID_SEG_X_INDEX].segSize = curReportSize;
									
									startBit += curReportSize;
								}
								else if (arrUsage[j].usage[0] == USAGE_Y)
								{
									//是y
									pHidSegStruct->HIDSeg[HID_SEG_Y_INDEX].segStart = startBit;
									pHidSegStruct->HIDSeg[HID_SEG_Y_INDEX].segSize = curReportSize;
                                    
									startBit += curReportSize;
								}
								else if (arrUsage[j].usage[0] == USAGE_WHEEL)
								{
									//是滚轮
									pHidSegStruct->HIDSeg[HID_SEG_WHEEL_INDEX].segStart = startBit;
									pHidSegStruct->HIDSeg[HID_SEG_WHEEL_INDEX].segSize = curReportSize;
                                    
									startBit += curReportSize;
								}
								else
								{
									//其它page
									if (usagePtr == 1)
									{
										//只有一个page
										startBit += curReportSize * curReportCount;
									}
									else
									{
										//有多个page
										startBit += curReportSize;
									}
								}
							}
							else
							{
								if (usagePtr == 1)
								{
									//只有一个page
									startBit += curReportSize * curReportCount;
								}
								else
								{
									//有多个page
									startBit += curReportSize;
								}
							}
							
							j++;
						}					
					}
				}	
			}
			
