zhuhuijia0001/ch559-usb-host/UsbHost.c
			usagePtr = 0;
			
			break;
			
		case TYPE_GLOBAL:
			if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_REPORT_ID)
			{
				//是report id
				startBit += dataSize * 8;
				
				if (curReportID != 0)
				{
					//直接退出
					i = len;
				}

				curReportID = *(p + 1);
			}
			else if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_REPORT_SIZE)
			{
				//是report size
				curReportSize = *(p + 1);
			}
			else if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_REPORT_COUNT)
			{
				//是report count
				curReportCount = *(p + 1);
			}
			else if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_USAGE_PAGE)
			{
				//是usage page
				curUsagePage = *(p + 1);
			}
			
			break;
			
		case TYPE_LOCAL:
			if (hid_item.ItemDetails.ItemVal.ItemTag == TAG_USAGE)
			{
				for (j = 0; j < dataSize; j++)
				{
					arrUsage[usagePtr].usage[j] = *(p + j + 1);
				}			
				arrUsage[usagePtr].usageLen = dataSize;

				usagePtr++;
			}
			
			break;
			
		}
		
		p += (dataSize + 1);
		
		i += (dataSize + 1);
	}
	
	return TRUE;
}

static UINT8 ParseKeyboardReportDescriptor(const UINT8 *pDescriptor, UINT16 len, HID_SEG_STRUCT *const pHidSegStruct)
{
    pHidSegStruct->HIDSeg[HID_SEG_KEYBOARD_INDEX].segStart = 0xff;
    pHidSegStruct->HIDSeg[HID_SEG_KEYBOARD_INDEX].segSize = 0;

    return ParseReportDescriptor(pDescriptor, len, pHidSegStruct);
}

static UINT8 ParseMouseReportDescriptor(const UINT8 *pDescriptor, UINT16 len, HID_SEG_STRUCT *const pHidSegStruct)
{
    pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segStart = 0xff;
    pHidSegStruct->HIDSeg[HID_SEG_BUTTON_INDEX].segSize = 0;

    pHidSegStruct->HIDSeg[HID_SEG_X_INDEX].segStart = 0xff;
    pHidSegStruct->HIDSeg[HID_SEG_X_INDEX].segSize = 0;

    pHidSegStruct->HIDSeg[HID_SEG_Y_INDEX].segStart = 0xff;
    pHidSegStruct->HIDSeg[HID_SEG_Y_INDEX].segSize = 0;

    pHidSegStruct->HIDSeg[HID_SEG_WHEEL_INDEX].segStart = 0xff;
    pHidSegStruct->HIDSeg[HID_SEG_WHEEL_INDEX].segSize = 0;
    
    return ParseReportDescriptor(pDescriptor, len, pHidSegStruct);
}

//enum device
static BOOL EnumerateHubPort(USB_HUB_PORT *const pUsbHubPort, UINT8 addr)
{
	UINT8 i, s;
	UINT16 len;
	UINT16 cfgDescLen;		
	
	USB_DEVICE *pUsbDevice;
	USB_CFG_DESCR *pCfgDescr;
	
	pUsbDevice = &pUsbHubPort->UsbDevice;
	
	//get first 8 bytes of device descriptor to get maxpacketsize0
	s = GetDeviceDescr(pUsbDevice->MaxPacketSize0, ReceiveDataBuffer, 8, &len);
	
	if (s != ERR_SUCCESS)
	{
		TRACE1("GetDeviceDescr failed,s:0x%02X\r\n", (UINT16)s);
		
		return(FALSE);
	}
	
	TRACE("GetDeviceDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	ParseDeviceDescriptor((USB_DEV_DESCR *)ReceiveDataBuffer, len, pUsbDevice);
	pUsbDevice->DeviceAddress = addr;

	TRACE1("MaxPacketSize0=%bd\r\n", pUsbDevice->MaxPacketSize0);

	//set device address
	s = SetUsbAddress(pUsbDevice->MaxPacketSize0, pUsbDevice->DeviceAddress);
	if (s != ERR_SUCCESS) 
	{
		return(FALSE);
	}
	
	TRACE("SetUsbAddress OK\r\n");
	TRACE1("address=%bd\r\n", pUsbDevice->DeviceAddress);
	
	//get full bytes of device descriptor
	s = GetDeviceDescr(pUsbDevice->MaxPacketSize0, ReceiveDataBuffer, sizeof(USB_DEV_DESCR), &len);
	
	if (s != ERR_SUCCESS)
	{
		TRACE("GetDeviceDescr failed\r\n");
		
		return(FALSE);
	}
	
	TRACE("GetDeviceDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	ParseDeviceDescriptor((USB_DEV_DESCR *)ReceiveDataBuffer, len, pUsbDevice);
	TRACE3("VendorID=0x%04X,ProductID=0x%04X,bcdDevice=0x%04X\r\n", pUsbDevice->VendorID, pUsbDevice->ProductID, pUsbDevice->bcdDevice);

	//get configure descriptor for the first time
	cfgDescLen = sizeof(USB_CFG_DESCR);
	TRACE1("GetConfigDescr with cfgDescLen=%d\r\n", cfgDescLen);
	s = GetConfigDescr(pUsbDevice->MaxPacketSize0, ReceiveDataBuffer, cfgDescLen, &len);
	if (s != ERR_SUCCESS)
	{
		TRACE("GetConfigDescr 1 failed\r\n");

		return(FALSE);
	}
	
	//get configure descriptor for the second time	
	pCfgDescr = (USB_CFG_DESCR *)ReceiveDataBuffer;
	cfgDescLen = pCfgDescr->wTotalLengthL | (pCfgDescr->wTotalLengthH << 8);
	if (cfgDescLen > RECEIVE_BUFFER_LEN)
	{
		cfgDescLen = RECEIVE_BUFFER_LEN;
	}
	TRACE1("GetConfigDescr with cfgDescLen=%d\r\n", cfgDescLen);
 
	s = GetConfigDescr(pUsbDevice->MaxPacketSize0, ReceiveDataBuffer, cfgDescLen, &len);
	if (s != ERR_SUCCESS)
	{
		TRACE("GetConfigDescr 2 failed\r\n");
	
		return(FALSE);
	}
		
	//parse config descriptor
	ParseConfigDescriptor((USB_CFG_DESCR *)ReceiveDataBuffer, len, pUsbDevice);		
		
	TRACE("GetConfigDescr OK\r\n");
	TRACE1("len=%d\r\n", len);
	
	//set config	
	s = SetUsbConfig(pUsbDevice->MaxPacketSize0, ((USB_CFG_DESCR *)ReceiveDataBuffer)->bConfigurationValue);
	if (s != ERR_SUCCESS)
	{			
		return(FALSE);
	}

	TRACE("SetUsbConfig OK\r\n");
	TRACE1("configure=%bd\r\n", ((USB_CFG_DESCR *)ReceiveDataBuffer)->bConfigurationValue);
	
	TRACE1("pUsbDevice->InterfaceNum=%d\r\n", (UINT16)pUsbDevice->InterfaceNum);	
	
	if (pUsbDevice->DeviceClass != USB_DEV_CLASS_HUB)
	{
		for (i = 0; i < pUsbDevice->InterfaceNum; i++)
		{
#ifdef DEBUG 
			int j;
#endif
			UINT8 interfaceClass = pUsbDevice->Interface[i].InterfaceClass;

			TRACE1("InterfaceClass=0x%x\r\n", (UINT16)pUsbDevice->Interface[i].InterfaceClass);
			TRACE1("InterfaceProtocol=0x%x\r\n", (UINT16)pUsbDevice->Interface[i].InterfaceProtocol);

#ifdef DEBUG
			for (j = 0; j < pUsbDevice->Interface[i].EndpointNum; j++)
			{
				if (pUsbDevice->Interface[i].Endpoint[j].EndpointDir == ENDPOINT_OUT)
				{
					TRACE1("endpoint %bd out\r\n", pUsbDevice->Interface[i].Endpoint[j].EndpointAddr);
				}
				else
				{
					TRACE1("endpoint %bd in\r\n", pUsbDevice->Interface[i].Endpoint[j].EndpointAddr);
				}

				TRACE1("endpoint packet size=%d\r\n", pUsbDevice->Interface[i].Endpoint[j].MaxPacketSize);
			}
#endif

			if (interfaceClass == USB_DEV_CLASS_HID)
			{	
				s = SetIdle(pUsbDevice->MaxPacketSize0, 0, 0, i);
			
				if (s != ERR_SUCCESS)
				{						
					TRACE("SetIdle failed\r\n");
				}
				else
				{
					TRACE("SetIdle OK\r\n");
				}
	
				TRACE1("Interface %bd:", i);
				TRACE1("InterfaceProtocol:%bd\r\n", pUsbDevice->Interface[i].InterfaceProtocol);
				if (pUsbDevice->Interface[i].InterfaceProtocol == HID_PROTOCOL_KEYBOARD)
				{
				    UINT8 led;
				    
				    s = GetReportDescriptor(pUsbDevice->MaxPacketSize0, i, ReceiveDataBuffer, sizeof(ReceiveDataBuffer), &len);
							
