zhuhuijia0001/ch559-usb-host/UsbHost.c
					if (s != ERR_SUCCESS)
					{							
						return FALSE;
					}
							
					TRACE("GetKeyboardReportDescriptor OK\r\n");
					TRACE1("report descr len:%d\r\n", len);
					
				    ParseKeyboardReportDescriptor(ReceiveDataBuffer, len, &pUsbDevice->Interface[i].HidSegStruct);

				    TRACE2("keyboardStart=%bd,keyboardSize=%bd\r\n", 
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_KEYBOARD_INDEX].segStart,
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_KEYBOARD_INDEX].segSize);
        			    
					led = GetKeyboardLedStatus();
					SetReport(pUsbDevice->MaxPacketSize0, i, &led, sizeof(led));	
					TRACE("SetReport\r\n");			
				}
				else if (pUsbDevice->Interface[i].InterfaceProtocol == HID_PROTOCOL_MOUSE)
				{
					s = GetReportDescriptor(pUsbDevice->MaxPacketSize0, i, ReceiveDataBuffer, sizeof(ReceiveDataBuffer), &len);
							
					if (s != ERR_SUCCESS)
					{							
						return FALSE;
					}
							
					TRACE("GetMouseReportDescriptor OK\r\n");
					TRACE1("report descr len:%d\r\n", len);

		#ifdef DEBUG
					{
						UINT16 k;
						for (k = 0; k < len; k++)
						{
							TRACE1("0x%02X ", (UINT16)ReceiveDataBuffer[k]);
						}
						TRACE("\r\n");
					}
		#endif
		
					ParseMouseReportDescriptor(ReceiveDataBuffer, len, &pUsbDevice->Interface[i].HidSegStruct);						
        			TRACE2("buttonStart=%bd,buttonSize=%bd\r\n", 
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_BUTTON_INDEX].segStart,
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_BUTTON_INDEX].segSize);
        			TRACE2("xStart=%bd,xSize=%bd\r\n", 
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_X_INDEX].segStart,
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_X_INDEX].segSize);
        			TRACE2("yStart=%bd,ySize=%bd\r\n", 
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_Y_INDEX].segStart,
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_Y_INDEX].segSize);
        			TRACE2("wheelStart=%bd,wheelSize=%bd\r\n", 
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_WHEEL_INDEX].segStart,
        			    pUsbDevice->Interface[i].HidSegStruct.HIDSeg[HID_SEG_WHEEL_INDEX].segSize);
				}
			}		
		}
	}
	
	return(TRUE);	
}


static UINT8 AssignUniqueAddress(UINT8 RootHubIndex, UINT8 HubPortIndex)
{
	UINT8 address;
	if (HubPortIndex == EXHUB_PORT_NONE)
	{
		address = (MAX_EXHUB_PORT_NUM + 1) * RootHubIndex + 1;
	}
	else
	{
		address = (MAX_EXHUB_PORT_NUM + 1) * RootHubIndex + 1 + HubPortIndex + 1;
	}

	return address;
}

static BOOL EnumerateRootHubPort(UINT8 port)
{
	UINT8 i, s;
	UINT16 len;

	UINT8  retry=0;

	UINT8 addr;
	
	if (RootHubPort[port].HubPortStatus != PORT_DEVICE_INSERT)
	{
		return FALSE;
	}
	
	TRACE1("enumerate port:%bd\r\n", port);

	ResetRootHubPort(port); 			 

#if 1
	for ( i = 0, s = 0; i < 10; i ++ ) 						 // 等待USB设备复位后重新连接,100mS超时
	{
		EnableRootHubPort(port);

		mDelaymS(1);
	}
	
#else
	for ( i = 0, s = 0; i < 100; i ++ ) 						 // 等待USB设备复位后重新连接,100mS超时
	{
		mDelaymS( 1 );
		if (EnableRootHubPort( port ) == ERR_SUCCESS )    // 使能ROOT-HUB端口
		{
			i = 0;
			s ++;												   // 计时等待USB设备连接后稳定
			if ( s > 10*retry )
			{
				break;											   // 已经稳定连接15mS
			}
		}
	}

	TRACE1("i:%d\r\n", (UINT16)i);
	
	if ( i )													   // 复位后设备没有连接
	{
		DisableRootHubPort( port );
		TRACE1( "Disable root hub %1d# port because of disconnect\n", (UINT16)port );

		return( ERR_USB_DISCON );
	}
	#endif
	
	mDelaymS(100);

	SelectHubPort(port, EXHUB_PORT_NONE);

	addr = AssignUniqueAddress(port, EXHUB_PORT_NONE);
	if (EnumerateHubPort(&RootHubPort[port], addr))
	{
		RootHubPort[port].HubPortStatus = PORT_DEVICE_ENUM_SUCCESS;
		
		TRACE("EnumerateHubPort success\r\n");

		//SelectHubPort(port, EXHUB_PORT_NONE);
		if (RootHubPort[port].UsbDevice.DeviceClass == USB_DEV_CLASS_HUB)
		{
			//hub
			UINT8 hubPortNum;
			UINT16 hubPortStatus, hubPortChange;
			USB_DEVICE *pUsbDevice = &RootHubPort[port].UsbDevice;
			
			//hub
			s = GetHubDescriptor(pUsbDevice->MaxPacketSize0, ReceiveDataBuffer, sizeof(USB_HUB_DESCR), &len);
			if (s != ERR_SUCCESS)
			{
				DisableRootHubPort(port);
			
				RootHubPort[port].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
		
				return(FALSE);
			}
		
			TRACE("GetHubDescriptor OK\r\n");
			TRACE1("len=%d\r\n", len);
		
			hubPortNum = ((USB_HUB_DESCR *)ReceiveDataBuffer)->bNbrPorts;
		
			TRACE1("hubPortNum=%bd\r\n", hubPortNum);
		
			if (hubPortNum > MAX_EXHUB_PORT_NUM)
			{
				hubPortNum = MAX_EXHUB_PORT_NUM;
			}
		
			pUsbDevice->HubPortNum = hubPortNum;

			//supply power for each port
			for (i = 0; i < hubPortNum; i++)						
			{
				s = SetHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_PORT_POWER);
				if (s != ERR_SUCCESS)
				{
					TRACE1("SetHubPortFeature %d failed\r\n", (UINT16)i);
					
					SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
				
					continue;	
				}
				
				TRACE("SetHubPortFeature OK\r\n");
			}

			for (i = 0; i < hubPortNum; i++)
            {
                s = ClearHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_C_PORT_CONNECTION );
                if ( s != ERR_SUCCESS )
                {
                    TRACE1("ClearHubPortFeature %d failed\r\n", (UINT16)i);

                    continue;
                }

                TRACE("ClearHubPortFeature OK\r\n");
            }
		
			for (i = 0; i < hubPortNum; i++)
			{	
				mDelaymS(50);
				
				SelectHubPort(port, EXHUB_PORT_NONE);  //切换到hub地址
				
				s = GetHubPortStatus(pUsbDevice->MaxPacketSize0, i + 1, &hubPortStatus, &hubPortChange);
				if (s != ERR_SUCCESS)
				{
					SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
		
					return FALSE;
				}
				
				if ((hubPortStatus & 0x0001) && (hubPortChange & 0x0001))
				{
					//device attached
					TRACE1("hubPort=%d\r\n", (UINT16)i);

					TRACE("device attached\r\n");

					mDelaymS(100);
					
					s = SetHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_PORT_RESET);		//reset the port device
					if (s != ERR_SUCCESS)
					{
						SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
			
						return FALSE;
					}
		
					do
					{
						s = GetHubPortStatus(pUsbDevice->MaxPacketSize0, i + 1, &hubPortStatus, &hubPortChange);
						if (s != ERR_SUCCESS)
						{
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
				
							return FALSE;
						}

						mDelaymS(1);
					} while (hubPortStatus & 0x0010);
		
					if ((hubPortChange & 0x10) == 0x10)					//reset over success
					{	
						TRACE("reset complete\r\n");
						
						if (hubPortStatus & 0x0200)				
						{
							//speed low
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].UsbDevice.DeviceSpeed = LOW_SPEED;	
							
							TRACE("low speed device\r\n");
						}
						else
						{
							//full speed device
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].UsbDevice.DeviceSpeed = FULL_SPEED;
								
							TRACE("full speed device\r\n");
							
