zhuhuijia0001/ch559-usb-host/UsbHost.c
						}
						
						s = ClearHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_PORT_RESET);
						if (s != ERR_SUCCESS)
						{
							TRACE("ClearHubPortFeature failed\r\n");		
						}
						else
						{
							TRACE("ClearHubPortFeature OK\r\n");
						}
						
						s = ClearHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_PORT_SUSPEND);
						if (s != ERR_SUCCESS)
						{
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
							TRACE("ClearHubPortFeature failed\r\n");
				
							return FALSE;			
						}
			
						TRACE("ClearHubPortFeature OK\r\n");
			
						s = ClearHubPortFeature(pUsbDevice->MaxPacketSize0, i + 1, HUB_C_PORT_CONNECTION);
						if (s != ERR_SUCCESS)
						{
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
							TRACE("ClearHubPortFeature failed\r\n");
				
							return FALSE;			
						}
			
						TRACE("ClearHubPortFeature OK\r\n");

						mDelaymS(100);
						
						SelectHubPort(port, i);

						addr = AssignUniqueAddress(port, i);
						if (EnumerateHubPort(&SubHubPort[MAX_EXHUB_PORT_NUM * port + i], addr))
						{
							TRACE("EnumerateHubPort success\r\n");
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_SUCCESS;
						}
						else
						{
							TRACE("EnumerateHubPort failed\r\n");
							SubHubPort[MAX_EXHUB_PORT_NUM * port + i].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
						}	
					}	
				}
			}			
		}
	}
	else
	{
		DisableRootHubPort(port);
		
		RootHubPort[port].HubPortStatus = PORT_DEVICE_ENUM_FAILED;
	}

	return TRUE;
}


static UINT8 QueryHubPortAttach(void)
{
	BOOL res = FALSE;

	UINT8 s = ERR_SUCCESS;
	
	if (UIF_DETECT)
	{
		//plug in or plug out 
		UIF_DETECT = 0;
		
		if (USB_HUB_ST & bUHS_H0_ATTACH)
		{
			//port 0 plug in 
			if (RootHubPort[0].HubPortStatus == PORT_DEVICE_NONE
				/*|| (UHUB0_CTRL & bUH_PORT_EN) == 0x00*/)
			{
				DisableRootHubPort(0);

				RootHubPort[0].HubPortStatus = PORT_DEVICE_INSERT;

				s = ERR_USB_CONNECT;

				TRACE("hub 0 dev in\r\n");
			}
		}
		else if (RootHubPort[0].HubPortStatus >= PORT_DEVICE_INSERT)
		{
			DisableRootHubPort(0);
			
			if (s == ERR_SUCCESS)
			{
				s = ERR_USB_DISCON;
			}

			TRACE("hub 0 dev out\r\n");
		}
		
		if (USB_HUB_ST & bUHS_H1_ATTACH)
		{
			//port 1 plug in 
			if (RootHubPort[1].HubPortStatus == PORT_DEVICE_NONE
				/*|| ( UHUB1_CTRL & bUH_PORT_EN ) == 0x00*/)
			{
				DisableRootHubPort(1);

				RootHubPort[1].HubPortStatus = PORT_DEVICE_INSERT;

				s = ERR_USB_CONNECT;

				TRACE("hub 1 dev in\r\n");
			}

		}
		else if (RootHubPort[1].HubPortStatus >= PORT_DEVICE_INSERT)
		{
			DisableRootHubPort(1);

			if (s == ERR_SUCCESS)
			{
				s = ERR_USB_DISCON;
			}

			TRACE("hub 1 dev out\r\n");
		}
	}

	return s;
}

//----------------------------------------------------------------------------------
void DealUsbPort(void)			//main function should use it at least 500ms
{
	UINT8 s = QueryHubPortAttach();
	if (s == ERR_USB_CONNECT)
	{
		UINT8 i;

		mDelaymS(100);
		for (i = 0; i < ROOT_HUB_PORT_NUM; i++)
		{
			EnumerateRootHubPort(i);
		}
	}
}

void InterruptProcessRootHubPort(UINT8 port)
{	
	USB_HUB_PORT *pUsbHubPort = &RootHubPort[port];

	if (pUsbHubPort->HubPortStatus == PORT_DEVICE_ENUM_SUCCESS)
	{
		if (pUsbHubPort->UsbDevice.DeviceClass != USB_DEV_CLASS_HUB)
		{
			SelectHubPort(port, EXHUB_PORT_NONE);
			
			HIDDataTransferReceive(&pUsbHubPort->UsbDevice);
		}
		else
		{
			UINT8 exHubPortNum = pUsbHubPort->UsbDevice.HubPortNum;
			UINT8 i;

			for (i = 0; i < exHubPortNum; i++)
			{
				pUsbHubPort = &SubHubPort[port * MAX_EXHUB_PORT_NUM + i];
				
				if (pUsbHubPort->HubPortStatus == PORT_DEVICE_ENUM_SUCCESS
					&& pUsbHubPort->UsbDevice.DeviceClass != USB_DEV_CLASS_HUB)
				{	
					SelectHubPort(port, i);
					
					HIDDataTransferReceive(&pUsbHubPort->UsbDevice);
				}
			}
		}	
	}
}

static void UpdateUsbKeyboardLedInternal(USB_DEVICE *const pUsbDevice, UINT8 led)
{
	UINT8 i;
	for (i = 0; i < pUsbDevice->InterfaceNum; i++)
	{
		if (pUsbDevice->Interface[i].InterfaceClass == USB_DEV_CLASS_HID)
		{
			if (pUsbDevice->Interface[i].InterfaceProtocol == HID_PROTOCOL_KEYBOARD)
			{
				SetReport(pUsbDevice->MaxPacketSize0, i, &led, 1);

				TRACE1("led=0x%x\r\n", led);
			}
		}
	}
}

//-----------------------------------------------------------------------------
void UpdateUsbKeyboardLed(UINT8 led)
{
	UINT8 i, j;
	
	for (i = 0; i < ROOT_HUB_PORT_NUM; i++)
	{
		USB_HUB_PORT *pUsbHubPort = &RootHubPort[i];
		if (pUsbHubPort->HubPortStatus == PORT_DEVICE_ENUM_SUCCESS)
		{
			if (pUsbHubPort->UsbDevice.DeviceClass != USB_DEV_CLASS_HUB)
			{
				SelectHubPort(i, EXHUB_PORT_NONE);
				
				UpdateUsbKeyboardLedInternal(&pUsbHubPort->UsbDevice, led);				
			}
			else
			{
				int exHubPortNum = pUsbHubPort->UsbDevice.HubPortNum;
		
				for (j = 0; j < exHubPortNum; j++)
				{
					pUsbHubPort = &SubHubPort[i * MAX_EXHUB_PORT_NUM + j];
					
					if (pUsbHubPort->HubPortStatus == PORT_DEVICE_ENUM_SUCCESS
						&& pUsbHubPort->UsbDevice.DeviceClass != USB_DEV_CLASS_HUB)
					{
						SelectHubPort(i, j);
						
						UpdateUsbKeyboardLedInternal(&pUsbHubPort->UsbDevice, led);
					}
				}
			}	
		}
	}
}

